app/Controllers/frontend/ProductController.php

SELECT *
FROM `products`
---
    public function index()
    {
        $model = new ProductModel();
        $data =  $model->findAll();

SELECT *
FROM `products`
WHERE `id` = '3'
---
    public function show($id = null)
    {
        $model = new ProductModel();
        $data = $model->getWhere(['id' => $id])->getResult();