app/Controllers/CategoryController.php

SELECT *
FROM `category`
---
    public function index()
    {
        $data['category'] =  $this->category->findAll();