app/Controllers/LoginController.php

    public function login()
    {
        $session =  session();
        $userModel =  new UserModel();
        $email =  $this->request->getVar('email');
        $formpass =  $this->request->getVar('password');

        $data = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'abcdddd@gmail.com'
 LIMIT 1