app/Controllers/ProductController.php

SELECT *
FROM `products`
JOIN `category` ON `category`.`id` = `products`.`category_id`
---
    public function index()
    {

        $data['products'] =  $this->products->findAll();

SELECT *
FROM `category`
---
    public function create()
    {
        $this->products->join('category', 'category.id = products.category_id');
        $data['cats'] =  $this->category->findAll();     // get cat data

INSERT INTO `products` (`product`, `category_id`, `price`, `sku`, `model`) VALUES ('new shirt', '2', '1500', '213', 'yamaha')
---
    public function store()
    {
        //return $this->request->getVar('name');   // get data from the form
        $data = [
            'product' => $this->request->getVar('name'),
            'category_id' => $this->request->getVar('cat'),
            'price' => $this->request->getVar('price'),
            'sku' => $this->request->getVar('sku'),
            'model' => $this->request->getVar('model'),
            // 'photo' => $this->request->getFile('photo')->getName('photo'),
        ];

        // print_r($data);



        $rules = [
            'name' => 'required|max_length[30]',
            'photo' => 'uploaded[photo]|max_size[photo,1024]|ext_in[photo,jpg,jpeg]',
            // 'password' => 'required|max_length[255]|min_length[10]',
            // 'passconf' => 'required|max_length[255]|matches[password]',
            // 'email'    => 'required|max_length[254]|valid_email',
        ];

        if (! $this->validate($rules)) {
            return view('/products/create');
        } else {
            // echo WRITEPATH;      // (check path to upload folder)
            // $img = $this->request->getFile('photo');
            // $img->move( WRITEPATH.'uploads' );
            $this->products->insert($data);

SELECT *
FROM `products`
WHERE `products`.`product_id` = '16'
---
    public function edit($id){
        // echo $id;
        $data = $this->products->find($id);

UPDATE `products` SET `product` = 'gellellos', `category` = NULL, `price` = '10', `sku` = 'asd', `model` = 'Samsung'
WHERE `products`.`product_id` IN ('15')
---
public function update($id){
    $data = [
        'product' => $this->request->getVar('name'),
        'category' => $this->request->getVar('cat'),
        'price' => $this->request->getVar('price'),
        'sku' => $this->request->getVar('sku'),
        'model' => $this->request->getVar('model'),
    ];

    $this->products->update($id, $data);